# PlacementLeft Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PlacementLeft Property
ParameterTypeId Class See Also
---
"Left"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PlacementLeft { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PlacementLeft As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PlacementLeft {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace